      *>  BOOK PARA ARMAZENAR AS VARIAVEIS DAS MOEDAS
           77 WRK-REAL         PIC 9(2)V99 VALUE 1,00.
           77 WRK-DOLAR        PIC 9(2)V99 VALUE 6,10.
           77 WRK-EURO         PIC 9(2)V99 VALUE 6,40.
           77 WRK-YUAN         PIC 9(2)V99 VALUE 0,84.
